Revit 2026 API

# RoomUnplace Method

---

Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Unplace()
```
```vb
Public Sub Unplace
```
```cpp
public:
void Unplace()
```
```fsharp
member Unplace : unit -> unit
```

Note that current room is changed to unplaced and all corresponding rooms which in other group instance are deleted when in group edit mode.

#### Reference

Room Class

Autodesk.Revit.DB.Architecture Namespace